# 政大財管二 蘇春佑
會python函數、java物件導向、與matplotlib繪圖

# 第一題

In [1]:
import pandas as pd

# Read Data

In [4]:
df=pd.read_csv('CollaQuantQuiz.csv')
df

          A        B
0   3555.00  1930.00
1   3545.00  1870.00
2   3560.00  1775.00
3   3725.00  1790.00
4   3715.00  1630.00
..      ...      ...
94  3724.95  1070.38
95  3871.99  1135.10
96  3813.17  1120.17
97  3783.76  1125.15
98  3685.74  1055.45

[99 rows x 2 columns]

In [11]:
df.describe()[1:3]

                A            B
mean  3904.863939  1572.834848
std    192.674173   273.840012

In [9]:
df.corr()

          A         B
A  1.000000  0.362602
B  0.362602  1.000000

In [14]:
output = pd.DataFrame(df.describe()[1:3])
output.append(df.corr())

                A            B
mean  3904.863939  1572.834848
std    192.674173   273.840012
A        1.000000     0.362602
B        0.362602     1.000000

# Hence, correlation between A, B is 0.3626

In [15]:
output.to_csv('px_last.csv')

# 第二題

$$y = \beta_0 + \beta_1 x $$
**Testing for  Significance: F Test**
$$H_0: \beta_1 = 0 \\ 
        H_1: \beta_1 \neq 0$$
**Test Statistic**
$$F = \frac{MSR}{MSE} \thicksim F(1, n-2)$$

$$if \: F \geq F_\alpha, then \space reject H_0\\
    else, do \: not \:reject \:H_0$$

# 加分題

By definition, we obtain the same correlation when we regress y on x and x on y.

However,  when we regress y on x$$\beta_1 = r * \frac{S_y}{S_x}$$
when we regress x on y $$\beta_1 = r * \frac{S_x}{S_y}$$